m-labs/dslite2svd/svd/tm4c123x.xml
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Texas Instruments</vendor>
  <vendorID>TI</vendorID>
  <name>TM4C123x</name>
  <series>Tiva C Series</series>
  <version>1</version>
  <description>(no description)</description>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <peripherals>
    <!-- overlay/tm4c123x-interrupts.xml -->
    <peripheral>
      <name>_INTERRUPTS</name>
      <baseAddress>0</baseAddress>
      <interrupt>
        <name>GPIOA</name>
        <description>GPIO Port A</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>GPIOB</name>
        <description>GPIO Port B</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>GPIOC</name>
        <description>GPIO Port C</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>GPIOD</name>
        <description>GPIO Port D</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>GPIOE</name>
        <description>GPIO Port E</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>UART0</name>
        <description>UART0</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>UART1</name>
        <description>UART1</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>SSI0</name>
        <description>SSI0</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>I2C0</name>
        <description>I2C0</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>PWM0_FAULT</name>
        <description>PWM0 Fault</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>PWM0_0</name>
        <description>PWM0 Generator 0</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>PWM0_1</name>
        <description>PWM0 Generator 1</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>PWM0_2</name>
        <description>PWM0 Generator 2</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>QEI0</name>
        <description>QEI0</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>ADC0SS0</name>
        <description>ADC0 Sequence 0</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>ADC0SS1</name>
        <description>ADC0 Sequence 1</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>ADC0SS2</name>
        <description>ADC0 Sequence 2</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>ADC0SS3</name>
        <description>ADC0 Sequence 3</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>WATCHDOG</name>
        <description>Watchdog Timers 0 and 1</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>TIMER0A</name>
        <description>16/32-Bit Timer 0A</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>TIMER0B</name>
        <description>16/32-Bit Timer 0B</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>TIMER1A</name>
        <description>16/32-Bit Timer 1A</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>TIMER1B</name>
        <description>16/32-Bit Timer 1B</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>TIMER2A</name>
        <description>16/32-Bit Timer 2A</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>TIMER2B</name>
        <description>16/32-Bit Timer 2B</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>COMP0</name>
        <description>Analog Comparator 0</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>COMP1</name>
        <description>Analog Comparator 1</description>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>SYSCTL</name>
        <description>System Control</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>FLASH</name>
        <description>Flash Memory Control and EEPROM Control</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>GPIOF</name>
        <description>GPIO Port F</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>UART2</name>
        <description>UART2</description>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>SSI1</name>
        <description>SSI1</description>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>TIMER3A</name>
        <description>Timer 3A</description>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>TIMER3B</name>
        <description>Timer 3B</description>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>I2C1</name>
        <description>I2C1</description>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>QEI1</name>
        <description>QEI1</description>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>CAN0</name>
        <description>CAN0</description>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>CAN1</name>
        <description>CAN1</description>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>HIBERNATE</name>
        <description>Hibernation Module</description>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>USB0</name>
        <description>USB</description>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>PWM0_3</name>
        <description>PWM Generator 3</description>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>UDMA</name>
        <description>uDMA Software</description>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>UDMAERR</name>
        <description>uDMA Error</description>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>ADC1SS0</name>
        <description>ADC1 Sequence 0</description>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>ADC1SS1</name>
        <description>ADC1 Sequence 1</description>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>ADC1SS2</name>
        <description>ADC1 Sequence 2</description>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>ADC1SS3</name>
        <description>ADC1 Sequence 3</description>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>SSI2</name>
        <description>SSI2</description>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>SSI3</name>
        <description>SSI3</description>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>UART3</name>
        <description>UART3</description>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>UART4</name>
        <description>UART4</description>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>UART5</name>
        <description>UART5</description>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>UART6</name>
        <description>UART6</description>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>UART7</name>
        <description>UART7</description>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>I2C2</name>
        <description>I2C2</description>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>I2C3</name>
        <description>I2C3</description>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>TIMER4A</name>
        <description>16/32-Bit Timer 4A</description>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>TIMER4B</name>
        <description>16/32-Bit Timer 4B</description>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>TIMER5A</name>
        <description>16/32-Bit Timer 5A</description>
        <value>92</value>
      </interrupt>
      <interrupt>
        <name>TIMER5B</name>
        <description>16/32-Bit Timer 5B</description>
        <value>93</value>
      </interrupt>
      <interrupt>
        <name>WTIMER0A</name>
        <description>32/64-Bit Timer 0A</description>
        <value>94</value>
      </interrupt>
      <interrupt>
        <name>WTIMER0B</name>
        <description>32/64-Bit Timer 0B</description>
        <value>95</value>
      </interrupt>
      <interrupt>
        <name>WTIMER1A</name>
        <description>32/64-Bit Timer 1A</description>
        <value>96</value>
      </interrupt>
      <interrupt>
        <name>WTIMER1B</name>
        <description>32/64-Bit Timer 1B</description>
        <value>97</value>
      </interrupt>
      <interrupt>
        <name>WTIMER2A</name>
        <description>32/64-Bit Timer 2A</description>
        <value>98</value>
      </interrupt>
      <interrupt>
        <name>WTIMER2B</name>
        <description>32/64-Bit Timer 2B</description>
        <value>99</value>
      </interrupt>
      <interrupt>
        <name>WTIMER3A</name>
        <description>32/64-Bit Timer 3A</description>
        <value>100</value>
      </interrupt>
      <interrupt>
        <name>WTIMER3B</name>
        <description>32/64-Bit Timer 3B</description>
        <value>101</value>
      </interrupt>
      <interrupt>
        <name>WTIMER4A</name>
        <description>32/64-Bit Timer 4A</description>
        <value>102</value>
      </interrupt>
      <interrupt>
        <name>WTIMER4B</name>
        <description>32/64-Bit Timer 4B</description>
        <value>103</value>
      </interrupt>
      <interrupt>
        <name>WTIMER5A</name>
        <description>32/64-Bit Timer 5A</description>
        <value>104</value>
      </interrupt>
      <interrupt>
        <name>WTIMER5B</name>
        <description>32/64-Bit Timer 5B</description>
        <value>105</value>
      </interrupt>
      <interrupt>
        <name>SYSEXC</name>
        <description>System Exception (imprecise)</description>
        <value>106</value>
      </interrupt>
      <interrupt>
        <name>PWM1_0</name>
        <description>PWM1 Generator 0</description>
        <value>134</value>
      </interrupt>
      <interrupt>
        <name>PWM1_1</name>
        <description>PWM1 Generator 1</description>
        <value>135</value>
      </interrupt>
      <interrupt>
        <name>PWM1_2</name>
        <description>PWM1 Generator 2</description>
        <value>136</value>
      </interrupt>
      <interrupt>
        <name>PWM1_3</name>
        <description>PWM1 Generator 3</description>
        <value>137</value>
      </interrupt>
      <interrupt>
        <name>PWM1_FAULT</name>
        <description>PWM1 Fault</description>
        <value>138</value>
      </interrupt>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/watchdog.xml -->
    <peripheral>
      <name>WATCHDOG0</name>
      <description>Watchdog Timer register offsets</description>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>LOAD</name>
          <displayName>WDT_LOAD</displayName>
          <description>Watchdog Load</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>VALUE</name>
          <displayName>WDT_VALUE</displayName>
          <description>Watchdog Value</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>CTL</name>
          <displayName>WDT_CTL</displayName>
          <description>Watchdog Control</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTEN</name>
              <description>Watchdog Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESEN</name>
              <description>Watchdog Reset Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTTYPE</name>
              <description>Watchdog Interrupt Type</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WRC</name>
              <description>Write Complete</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <displayName>WDT_ICR</displayName>
          <description>Watchdog Interrupt Clear</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>write-only</access>
        </register>
        <register>
          <name>RIS</name>
          <displayName>WDT_RIS</displayName>
          <description>Watchdog Raw Interrupt Status</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WDTRIS</name>
              <description>Watchdog Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <displayName>WDT_MIS</displayName>
          <description>Watchdog Masked Interrupt Status</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WDTMIS</name>
              <description>Watchdog Masked Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST</name>
          <displayName>WDT_TEST</displayName>
          <description>Watchdog Test</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STALL</name>
              <description>Watchdog Stall Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <displayName>WDT_LOCK</displayName>
          <description>Watchdog Lock</description>
          <addressOffset>0x00000C00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Watchdog Lock</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCKED</name>
                  <description>Unlocked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNLOCK</name>
                  <description>Unlocks the watchdog timer</description>
                  <value>0x1acce551</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
