m-labs/dslite2svd/svd/tm4c123x.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTB</name>
      <baseAddress>0x40005000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTC</name>
      <baseAddress>0x40006000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTD</name>
      <baseAddress>0x40007000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/ssi.xml -->
    <peripheral>
      <name>SSI0</name>
      <description>SSI register offsets</description>
      <baseAddress>0x40008000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>CR0</name>
          <displayName>SSI_CR0</displayName>
          <description>SSI Control 0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DSS</name>
              <description>SSI Data Size Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_4</name>
                  <description>4-bit data</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_5</name>
                  <description>5-bit data</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6</name>
                  <description>6-bit data</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_7</name>
                  <description>7-bit data</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8</name>
                  <description>8-bit data</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_9</name>
                  <description>9-bit data</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_10</name>
                  <description>10-bit data</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_11</name>
                  <description>11-bit data</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_12</name>
                  <description>12-bit data</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_13</name>
                  <description>13-bit data</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_14</name>
                  <description>14-bit data</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_15</name>
                  <description>15-bit data</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16</name>
                  <description>16-bit data</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRF</name>
              <description>SSI Frame Format Select</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MOTO</name>
                  <description>Freescale SPI Frame Format</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TI</name>
                  <description>Synchronous Serial Frame Format</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NMW</name>
                  <description>MICROWIRE Frame Format</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPO</name>
              <description>SSI Serial Clock Polarity</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPH</name>
              <description>SSI Serial Clock Phase</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SCR</name>
              <description>SSI Serial Clock Rate</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <displayName>SSI_CR1</displayName>
          <description>SSI Control 1</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LBM</name>
              <description>SSI Loopback Mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSE</name>
              <description>SSI Synchronous Serial Port Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MS</name>
              <description>SSI Master/Slave Select</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EOT</name>
              <description>End of Transmission</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <displayName>SSI_DR</displayName>
          <description>SSI Data</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>SSI Receive/Transmit Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SSI_SR</displayName>
          <description>SSI Status</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TFE</name>
              <description>SSI Transmit FIFO Empty</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TNF</name>
              <description>SSI Transmit FIFO Not Full</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RNE</name>
              <description>SSI Receive FIFO Not Empty</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RFF</name>
              <description>SSI Receive FIFO Full</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BSY</name>
              <description>SSI Busy Bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPSR</name>
          <displayName>SSI_CPSR</displayName>
          <description>SSI Clock Prescale</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPSDVSR</name>
              <description>SSI Clock Prescale Divisor</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <displayName>SSI_IM</displayName>
          <description>SSI Interrupt Mask</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RORIM</name>
              <description>SSI Receive Overrun Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RTIM</name>
              <description>SSI Receive Time-Out Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RXIM</name>
              <description>SSI Receive FIFO Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TXIM</name>
              <description>SSI Transmit FIFO Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <displayName>SSI_RIS</displayName>
          <description>SSI Raw Interrupt Status</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RORRIS</name>
              <description>SSI Receive Overrun Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RTRIS</name>
              <description>SSI Receive Time-Out Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RXRIS</name>
              <description>SSI Receive FIFO Raw Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TXRIS</name>
              <description>SSI Transmit FIFO Raw Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <displayName>SSI_MIS</displayName>
          <description>SSI Masked Interrupt Status</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RORMIS</name>
              <description>SSI Receive Overrun Masked Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RTMIS</name>
              <description>SSI Receive Time-Out Masked Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RXMIS</name>
              <description>SSI Receive FIFO Masked Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TXMIS</name>
              <description>SSI Transmit FIFO Masked Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <displayName>SSI_ICR</displayName>
          <description>SSI Interrupt Clear</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RORIC</name>
              <description>SSI Receive Overrun Interrupt Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RTIC</name>
              <description>SSI Receive Time-Out Interrupt Clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL</name>
          <displayName>SSI_DMACTL</displayName>
          <description>SSI DMA Control</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXDMAE</name>
              <description>Receive DMA Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDMAE</name>
              <description>Transmit DMA Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CC</name>
          <displayName>SSI_CC</displayName>
          <description>SSI Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CS</name>
              <description>SSI Baud Clock Source</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSPLL</name>
                  <description>System clock (based on clock source and divisor factor)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
