m-labs/dslite2svd/svd/tm4c123x.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce93xh6pm/qei.xml -->
    <peripheral derivedFrom="QEI0">
      <name>QEI1</name>
      <baseAddress>0x4002D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/timer.xml -->
    <peripheral>
      <name>TIMER0</name>
      <description>Timer register offsets</description>
      <baseAddress>0x40030000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>CFG</name>
          <displayName>TIMER_CFG</displayName>
          <description>GPTM Configuration</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CFG</name>
              <description>GPTM Configuration</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_32_BIT_TIMER</name>
                  <description>For a 16/32-bit timer, this value selects the 32-bit timer configuration</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32_BIT_RTC</name>
                  <description>For a 16/32-bit timer, this value selects the 32-bit real-time clock (RTC) counter configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_BIT</name>
                  <description>For a 16/32-bit timer, this value selects the 16-bit timer configuration</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMR</name>
          <displayName>TIMER_TAMR</displayName>
          <description>GPTM Timer A Mode</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TAMR</name>
              <description>GPTM Timer A Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_1_SHOT</name>
                  <description>One-Shot Timer mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIOD</name>
                  <description>Periodic Timer mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP</name>
                  <description>Capture mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TACMR</name>
              <description>GPTM Timer A Capture Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TAAMS</name>
              <description>GPTM Timer A Alternate Mode Select</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TACDIR</name>
              <description>GPTM Timer A Count Direction</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TAMIE</name>
              <description>GPTM Timer A Match Interrupt Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TAWOT</name>
              <description>GPTM Timer A Wait-on-Trigger</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TASNAPS</name>
              <description>GPTM Timer A Snap-Shot Mode</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TAILD</name>
              <description>GPTM Timer A Interval Load Write</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TAPWMIE</name>
              <description>GPTM Timer A PWM Interrupt Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TAMRSU</name>
              <description>GPTM Timer A Match Register Update</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TAPLO</name>
              <description>GPTM Timer A PWM Legacy Operation</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBMR</name>
          <displayName>TIMER_TBMR</displayName>
          <description>GPTM Timer B Mode</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TBMR</name>
              <description>GPTM Timer B Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_1_SHOT</name>
                  <description>One-Shot Timer mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIOD</name>
                  <description>Periodic Timer mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP</name>
                  <description>Capture mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBCMR</name>
              <description>GPTM Timer B Capture Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TBAMS</name>
              <description>GPTM Timer B Alternate Mode Select</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TBCDIR</name>
              <description>GPTM Timer B Count Direction</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TBMIE</name>
              <description>GPTM Timer B Match Interrupt Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TBWOT</name>
              <description>GPTM Timer B Wait-on-Trigger</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TBSNAPS</name>
              <description>GPTM Timer B Snap-Shot Mode</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TBILD</name>
              <description>GPTM Timer B Interval Load Write</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TBPWMIE</name>
              <description>GPTM Timer B PWM Interrupt Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TBMRSU</name>
              <description>GPTM Timer B Match Register Update</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TBPLO</name>
              <description>GPTM Timer B PWM Legacy Operation</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <displayName>TIMER_CTL</displayName>
          <description>GPTM Control</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TAEN</name>
              <description>GPTM Timer A Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TASTALL</name>
              <description>GPTM Timer A Stall Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TAEVENT</name>
              <description>GPTM Timer A Event Mode</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POS</name>
                  <description>Positive edge</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG</name>
                  <description>Negative edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCEN</name>
              <description>GPTM RTC Stall Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TAOTE</name>
              <description>GPTM Timer A Output Trigger Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TAPWML</name>
              <description>GPTM Timer A PWM Output Level</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TBEN</name>
              <description>GPTM Timer B Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TBSTALL</name>
              <description>GPTM Timer B Stall Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TBEVENT</name>
              <description>GPTM Timer B Event Mode</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POS</name>
                  <description>Positive edge</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG</name>
                  <description>Negative edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBOTE</name>
              <description>GPTM Timer B Output Trigger Enable</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TBPWML</name>
              <description>GPTM Timer B PWM Output Level</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
