m-labs/dslite2svd/svd/tm4c123x.xml
        <register>
          <name>SYNC</name>
          <displayName>TIMER_SYNC</displayName>
          <description>GPTM Synchronize</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNCT0</name>
              <description>Synchronize GPTM Timer 0</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPTM0 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM0 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM0 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM0 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCT1</name>
              <description>Synchronize GPTM Timer 1</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPTM1 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM1 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM1 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM1 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCT2</name>
              <description>Synchronize GPTM Timer 2</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPTM2 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM2 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM2 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM2 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCT3</name>
              <description>Synchronize GPTM Timer 3</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPTM3 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM3 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM3 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM3 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCT4</name>
              <description>Synchronize GPTM Timer 4</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPTM4 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM4 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM4 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM4 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCT5</name>
              <description>Synchronize GPTM Timer 5</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPTM5 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM5 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM5 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM5 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCWT0</name>
              <description>Synchronize GPTM 32/64-Bit Timer 0</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPTM 32/64-Bit Timer 0 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM 32/64-Bit Timer 0 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM 32/64-Bit Timer 0 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM 32/64-Bit Timer 0 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCWT1</name>
              <description>Synchronize GPTM 32/64-Bit Timer 1</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPTM 32/64-Bit Timer 1 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM 32/64-Bit Timer 1 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM 32/64-Bit Timer 1 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM 32/64-Bit Timer 1 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCWT2</name>
              <description>Synchronize GPTM 32/64-Bit Timer 2</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPTM 32/64-Bit Timer 2 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM 32/64-Bit Timer 2 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM 32/64-Bit Timer 2 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM 32/64-Bit Timer 2 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCWT3</name>
              <description>Synchronize GPTM 32/64-Bit Timer 3</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPTM 32/64-Bit Timer 3 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM 32/64-Bit Timer 3 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM 32/64-Bit Timer 3 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM 32/64-Bit Timer 3 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCWT4</name>
              <description>Synchronize GPTM 32/64-Bit Timer 4</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPTM 32/64-Bit Timer 4 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM 32/64-Bit Timer 4 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM 32/64-Bit Timer 4 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM 32/64-Bit Timer 4 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCWT5</name>
              <description>Synchronize GPTM 32/64-Bit Timer 5</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPTM 32/64-Bit Timer 5 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM 32/64-Bit Timer 5 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM 32/64-Bit Timer 5 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM 32/64-Bit Timer 5 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <displayName>TIMER_IMR</displayName>
          <description>GPTM Interrupt Mask</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TATOIM</name>
              <description>GPTM Timer A Time-Out Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAMIM</name>
              <description>GPTM Timer A Capture Mode Match Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAEIM</name>
              <description>GPTM Timer A Capture Mode Event Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCIM</name>
              <description>GPTM RTC Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TAMIM</name>
              <description>GPTM Timer A Match Interrupt Mask</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TBTOIM</name>
              <description>GPTM Timer B Time-Out Interrupt Mask</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CBMIM</name>
              <description>GPTM Timer B Capture Mode Match Interrupt Mask</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CBEIM</name>
              <description>GPTM Timer B Capture Mode Event Interrupt Mask</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TBMIM</name>
              <description>GPTM Timer B Match Interrupt Mask</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WUEIM</name>
              <description>32/64-Bit Wide GPTM Write Update Error Interrupt Mask</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <displayName>TIMER_RIS</displayName>
          <description>GPTM Raw Interrupt Status</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TATORIS</name>
              <description>GPTM Timer A Time-Out Raw Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CAMRIS</name>
              <description>GPTM Timer A Capture Mode Match Raw Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CAERIS</name>
              <description>GPTM Timer A Capture Mode Event Raw Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RTCRIS</name>
              <description>GPTM RTC Raw Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TAMRIS</name>
              <description>GPTM Timer A Match Raw Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TBTORIS</name>
              <description>GPTM Timer B Time-Out Raw Interrupt</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CBMRIS</name>
              <description>GPTM Timer B Capture Mode Match Raw Interrupt</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CBERIS</name>
              <description>GPTM Timer B Capture Mode Event Raw Interrupt</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TBMRIS</name>
              <description>GPTM Timer B Match Raw Interrupt</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WUERIS</name>
              <description>32/64-Bit Wide GPTM Write Update Error Raw Interrupt Status</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
