m-labs/dslite2svd/svd/tm4c123x.xml
        <register>
          <name>TSSEL</name>
          <displayName>ADC_TSSEL</displayName>
          <description>ADC Trigger Source Select</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PS0</name>
              <description>Generator 0 PWM Module Trigger Select</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>Use Generator 0 (and its trigger) in PWM module 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1</name>
                  <description>Use Generator 0 (and its trigger) in PWM module 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PS1</name>
              <description>Generator 1 PWM Module Trigger Select</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>Use Generator 1 (and its trigger) in PWM module 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1</name>
                  <description>Use Generator 1 (and its trigger) in PWM module 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PS2</name>
              <description>Generator 2 PWM Module Trigger Select</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>Use Generator 2 (and its trigger) in PWM module 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1</name>
                  <description>Use Generator 2 (and its trigger) in PWM module 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PS3</name>
              <description>Generator 3 PWM Module Trigger Select</description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>Use Generator 3 (and its trigger) in PWM module 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1</name>
                  <description>Use Generator 3 (and its trigger) in PWM module 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SSPRI</name>
          <displayName>ADC_SSPRI</displayName>
          <description>ADC Sample Sequencer Priority</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SS0</name>
              <description>SS0 Priority</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SS1</name>
              <description>SS1 Priority</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SS2</name>
              <description>SS2 Priority</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SS3</name>
              <description>SS3 Priority</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPC</name>
          <displayName>ADC_SPC</displayName>
          <description>ADC Sample Phase Control</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PHASE</name>
              <description>Phase Difference</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>ADC sample lags by 0.0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_22_5</name>
                  <description>ADC sample lags by 22.5</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_45</name>
                  <description>ADC sample lags by 45.0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_67_5</name>
                  <description>ADC sample lags by 67.5</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_90</name>
                  <description>ADC sample lags by 90.0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_112_5</name>
                  <description>ADC sample lags by 112.5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_135</name>
                  <description>ADC sample lags by 135.0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_157_5</name>
                  <description>ADC sample lags by 157.5</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_180</name>
                  <description>ADC sample lags by 180.0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_202_5</name>
                  <description>ADC sample lags by 202.5</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_225</name>
                  <description>ADC sample lags by 225.0</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_247_5</name>
                  <description>ADC sample lags by 247.5</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_270</name>
                  <description>ADC sample lags by 270.0</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_292_5</name>
                  <description>ADC sample lags by 292.5</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_315</name>
                  <description>ADC sample lags by 315.0</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_337_5</name>
                  <description>ADC sample lags by 337.5</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PSSI</name>
          <displayName>ADC_PSSI</displayName>
          <description>ADC Processor Sample Sequence Initiate</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SS0</name>
              <description>SS0 Initiate</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SS1</name>
              <description>SS1 Initiate</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SS2</name>
              <description>SS2 Initiate</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SS3</name>
              <description>SS3 Initiate</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCWAIT</name>
              <description>Synchronize Wait</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>GSYNC</name>
              <description>Global Synchronize</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAC</name>
          <displayName>ADC_SAC</displayName>
          <description>ADC Sample Averaging Control</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AVG</name>
              <description>Hardware Averaging Control</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No hardware oversampling</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2X</name>
                  <description>2x hardware oversampling</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4X</name>
                  <description>4x hardware oversampling</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8X</name>
                  <description>8x hardware oversampling</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16X</name>
                  <description>16x hardware oversampling</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32X</name>
                  <description>32x hardware oversampling</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64X</name>
                  <description>64x hardware oversampling</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCISC</name>
          <displayName>ADC_DCISC</displayName>
          <description>ADC Digital Comparator Interrupt Status and Clear</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DCINT0</name>
              <description>Digital Comparator 0 Interrupt Status and Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCINT1</name>
              <description>Digital Comparator 1 Interrupt Status and Clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCINT2</name>
              <description>Digital Comparator 2 Interrupt Status and Clear</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCINT3</name>
              <description>Digital Comparator 3 Interrupt Status and Clear</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCINT4</name>
              <description>Digital Comparator 4 Interrupt Status and Clear</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCINT5</name>
              <description>Digital Comparator 5 Interrupt Status and Clear</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCINT6</name>
              <description>Digital Comparator 6 Interrupt Status and Clear</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCINT7</name>
              <description>Digital Comparator 7 Interrupt Status and Clear</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <displayName>ADC_CTL</displayName>
          <description>ADC Control</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VREF</name>
              <description>Voltage Reference Select</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERNAL</name>
                  <description>VDDA and GNDA are the voltage references</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SSMUX0</name>
          <displayName>ADC_SSMUX0</displayName>
          <description>ADC Sample Sequence Input Multiplexer Select 0</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MUX0</name>
              <description>1st Sample Input Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX1</name>
              <description>2nd Sample Input Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX2</name>
              <description>3rd Sample Input Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX3</name>
              <description>4th Sample Input Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX4</name>
              <description>5th Sample Input Select</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX5</name>
              <description>6th Sample Input Select</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX6</name>
              <description>7th Sample Input Select</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX7</name>
              <description>8th Sample Input Select</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
