m-labs/dslite2svd/svd/tm4c123x.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/sysexc.xml -->
    <peripheral>
      <name>SYSEXC</name>
      <description>System Exception Module register addresses</description>
      <baseAddress>0x400F9000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>RIS</name>
          <displayName>SYSEXC_RIS</displayName>
          <description>System Exception Raw Interrupt Status</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FPIDCRIS</name>
              <description>Floating-Point Input Denormal Exception Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FPDZCRIS</name>
              <description>Floating-Point Divide By 0 Exception Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FPIOCRIS</name>
              <description>Floating-Point Invalid Operation Raw Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FPUFCRIS</name>
              <description>Floating-Point Underflow Exception Raw Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FPOFCRIS</name>
              <description>Floating-Point Overflow Exception Raw Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FPIXCRIS</name>
              <description>Floating-Point Inexact Exception Raw Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <displayName>SYSEXC_IM</displayName>
          <description>System Exception Interrupt Mask</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FPIDCIM</name>
              <description>Floating-Point Input Denormal Exception Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FPDZCIM</name>
              <description>Floating-Point Divide By 0 Exception Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIOCIM</name>
              <description>Floating-Point Invalid Operation Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FPUFCIM</name>
              <description>Floating-Point Underflow Exception Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FPOFCIM</name>
              <description>Floating-Point Overflow Exception Interrupt Mask</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIXCIM</name>
              <description>Floating-Point Inexact Exception Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <displayName>SYSEXC_MIS</displayName>
          <description>System Exception Masked Interrupt Status</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FPIDCMIS</name>
              <description>Floating-Point Input Denormal Exception Masked Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FPDZCMIS</name>
              <description>Floating-Point Divide By 0 Exception Masked Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FPIOCMIS</name>
              <description>Floating-Point Invalid Operation Masked Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FPUFCMIS</name>
              <description>Floating-Point Underflow Exception Masked Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FPOFCMIS</name>
              <description>Floating-Point Overflow Exception Masked Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FPIXCMIS</name>
              <description>Floating-Point Inexact Exception Masked Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IC</name>
          <displayName>SYSEXC_IC</displayName>
          <description>System Exception Interrupt Clear</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FPIDCIC</name>
              <description>Floating-Point Input Denormal Exception Interrupt Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>FPDZCIC</name>
              <description>Floating-Point Divide By 0 Exception Interrupt Clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>FPIOCIC</name>
              <description>Floating-Point Invalid Operation Interrupt Clear</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>FPUFCIC</name>
              <description>Floating-Point Underflow Exception Interrupt Clear</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>FPOFCIC</name>
              <description>Floating-Point Overflow Exception Interrupt Clear</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>FPIXCIC</name>
              <description>Floating-Point Inexact Exception Interrupt Clear</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
