m-labs/dslite2svd/svd/tm4c123x.xml
        <register>
          <name>DC2</name>
          <displayName>SYSCTL_DC2</displayName>
          <description>Device Capabilities 2</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART0</name>
              <description>UART Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART1</name>
              <description>UART Module 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART2</name>
              <description>UART Module 2 Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI0</name>
              <description>SSI Module 0 Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI1</name>
              <description>SSI Module 1 Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>QEI0</name>
              <description>QEI Module 0 Present</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>QEI1</name>
              <description>QEI Module 1 Present</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C0</name>
              <description>I2C Module 0 Present</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C0HS</name>
              <description>I2C Module 0 Speed</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C1</name>
              <description>I2C Module 1 Present</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C1HS</name>
              <description>I2C Module 1 Speed</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER0</name>
              <description>Timer Module 0 Present</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER1</name>
              <description>Timer Module 1 Present</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER2</name>
              <description>Timer Module 2 Present</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER3</name>
              <description>Timer Module 3 Present</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP0</name>
              <description>Analog Comparator 0 Present</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Analog Comparator 1 Present</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP2</name>
              <description>Analog Comparator 2 Present</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2S0</name>
              <description>I2S Module 0 Present</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EPI0</name>
              <description>EPI Module 0 Present</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC3</name>
          <displayName>SYSCTL_DC3</displayName>
          <description>Device Capabilities 3</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM0</name>
              <description>PWM0 Pin Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM1</name>
              <description>PWM1 Pin Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM2</name>
              <description>PWM2 Pin Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM3</name>
              <description>PWM3 Pin Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM4</name>
              <description>PWM4 Pin Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM5</name>
              <description>PWM5 Pin Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>C0MINUS</name>
              <description>C0- Pin Present</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>C0PLUS</name>
              <description>C0+ Pin Present</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>C0O</name>
              <description>C0o Pin Present</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>C1MINUS</name>
              <description>C1- Pin Present</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>C1PLUS</name>
              <description>C1+ Pin Present</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>C1O</name>
              <description>C1o Pin Present</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>C2MINUS</name>
              <description>C2- Pin Present</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>C2PLUS</name>
              <description>C2+ Pin Present</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>C2O</name>
              <description>C2o Pin Present</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWMFAULT</name>
              <description>PWM Fault Pin Present</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN0</name>
              <description>ADC Module 0 AIN0 Pin Present</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN1</name>
              <description>ADC Module 0 AIN1 Pin Present</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN2</name>
              <description>ADC Module 0 AIN2 Pin Present</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN3</name>
              <description>ADC Module 0 AIN3 Pin Present</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN4</name>
              <description>ADC Module 0 AIN4 Pin Present</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN5</name>
              <description>ADC Module 0 AIN5 Pin Present</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN6</name>
              <description>ADC Module 0 AIN6 Pin Present</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN7</name>
              <description>ADC Module 0 AIN7 Pin Present</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CCP0</name>
              <description>T0CCP0 Pin Present</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CCP1</name>
              <description>T0CCP1 Pin Present</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CCP2</name>
              <description>T1CCP0 Pin Present</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CCP3</name>
              <description>T1CCP1 Pin Present</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CCP4</name>
              <description>T2CCP0 Pin Present</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CCP5</name>
              <description>T2CCP1 Pin Present</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>_32KHZ</name>
              <description>32KHz Input Clock Available</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC4</name>
          <displayName>SYSCTL_DC4</displayName>
          <description>Device Capabilities 4</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIOA</name>
              <description>GPIO Port A Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIOB</name>
              <description>GPIO Port B Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIOC</name>
              <description>GPIO Port C Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIOD</name>
              <description>GPIO Port D Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIOE</name>
              <description>GPIO Port E Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIOF</name>
              <description>GPIO Port F Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIOG</name>
              <description>GPIO Port G Present</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIOH</name>
              <description>GPIO Port H Present</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIOJ</name>
              <description>GPIO Port J Present</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ROM</name>
              <description>Internal Code ROM Present</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UDMA</name>
              <description>Micro-DMA Module Present</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CCP6</name>
              <description>T3CCP0 Pin Present</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CCP7</name>
              <description>T3CCP1 Pin Present</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PICAL</name>
              <description>PIOSC Calibrate</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>E1588</name>
              <description>1588 Capable</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC0</name>
              <description>Ethernet MAC Layer 0 Present</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EPHY0</name>
              <description>Ethernet PHY Layer 0 Present</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC5</name>
          <displayName>SYSCTL_DC5</displayName>
          <description>Device Capabilities 5</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM0</name>
              <description>PWM0 Pin Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM1</name>
              <description>PWM1 Pin Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM2</name>
              <description>PWM2 Pin Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM3</name>
              <description>PWM3 Pin Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM4</name>
              <description>PWM4 Pin Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM5</name>
              <description>PWM5 Pin Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM6</name>
              <description>PWM6 Pin Present</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM7</name>
              <description>PWM7 Pin Present</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWMESYNC</name>
              <description>PWM Extended SYNC Active</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWMEFLT</name>
              <description>PWM Extended Fault Active</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWMFAULT0</name>
              <description>PWM Fault 0 Pin Present</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWMFAULT1</name>
              <description>PWM Fault 1 Pin Present</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWMFAULT2</name>
              <description>PWM Fault 2 Pin Present</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWMFAULT3</name>
              <description>PWM Fault 3 Pin Present</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC6</name>
          <displayName>SYSCTL_DC6</displayName>
          <description>Device Capabilities 6</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB0</name>
              <description>USB Module 0 Present</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEV</name>
                  <description>USB0 is Device Only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTDEV</name>
                  <description>USB is Device or Host</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OTG</name>
                  <description>USB0 is OTG</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB0PHY</name>
              <description>USB Module 0 PHY Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
