m-labs/dslite2svd/svd/tm4c123x.xml
        <register>
          <name>SRCR2</name>
          <displayName>SYSCTL_SRCR2</displayName>
          <description>Software Reset Control 2</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIOA</name>
              <description>Port A Reset Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIOB</name>
              <description>Port B Reset Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIOC</name>
              <description>Port C Reset Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIOD</name>
              <description>Port D Reset Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIOE</name>
              <description>Port E Reset Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIOF</name>
              <description>Port F Reset Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UDMA</name>
              <description>Micro-DMA Reset Control</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB0</name>
              <description>USB0 Reset Control</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <displayName>SYSCTL_RIS</displayName>
          <description>Raw Interrupt Status</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BOR1RIS</name>
              <description>VDD under BOR1 Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MOFRIS</name>
              <description>Main Oscillator Failure Raw Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PLLLRIS</name>
              <description>PLL Lock Raw Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USBPLLLRIS</name>
              <description>USB PLL Lock Raw Interrupt Status</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MOSCPUPRIS</name>
              <description>MOSC Power Up Raw Interrupt Status</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VDDARIS</name>
              <description>VDDA Power OK Event Raw Interrupt Status</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BOR0RIS</name>
              <description>VDD under BOR0 Raw Interrupt Status</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMC</name>
          <displayName>SYSCTL_IMC</displayName>
          <description>Interrupt Mask Control</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BOR1IM</name>
              <description>VDD under BOR1 Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MOFIM</name>
              <description>Main Oscillator Failure Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLLIM</name>
              <description>PLL Lock Interrupt Mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USBPLLLIM</name>
              <description>USB PLL Lock Interrupt Mask</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MOSCPUPIM</name>
              <description>MOSC Power Up Interrupt Mask</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VDDAIM</name>
              <description>VDDA Power OK Interrupt Mask</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BOR0IM</name>
              <description>VDD under BOR0 Interrupt Mask</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <displayName>SYSCTL_MISC</displayName>
          <description>Masked Interrupt Status and Clear</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BOR1MIS</name>
              <description>VDD under BOR1 Masked Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MOFMIS</name>
              <description>Main Oscillator Failure Masked Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLLMIS</name>
              <description>PLL Lock Masked Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USBPLLLMIS</name>
              <description>USB PLL Lock Masked Interrupt Status</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MOSCPUPMIS</name>
              <description>MOSC Power Up Masked Interrupt Status</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VDDAMIS</name>
              <description>VDDA Power OK Masked Interrupt Status</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BOR0MIS</name>
              <description>VDD under BOR0 Masked Interrupt Status</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESC</name>
          <displayName>SYSCTL_RESC</displayName>
          <description>Reset Cause</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EXT</name>
              <description>External Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>POR</name>
              <description>Power-On Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BOR</name>
              <description>Brown-Out Reset</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT0</name>
              <description>Watchdog Timer 0 Reset</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SW</name>
              <description>Software Reset</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT1</name>
              <description>Watchdog Timer 1 Reset</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MOSCFAIL</name>
              <description>MOSC Failure Reset</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCC</name>
          <displayName>SYSCTL_RCC</displayName>
          <description>Run-Mode Clock Configuration</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MOSCDIS</name>
              <description>Main Oscillator Disable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCSRC</name>
              <description>Oscillator Source</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAIN</name>
                  <description>MOSC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT</name>
                  <description>IOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT4</name>
                  <description>IOSC/4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_30</name>
                  <description>LFIOSC</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL</name>
              <description>Crystal Value</description>
              <lsb>6</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_4MHZ</name>
                  <description>4 MHz</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4_09MHZ</name>
                  <description>4.096 MHz</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4_91MHZ</name>
                  <description>4.9152 MHz</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_5MHZ</name>
                  <description>5 MHz</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_5_12MHZ</name>
                  <description>5.12 MHz</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6MHZ</name>
                  <description>6 MHz</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6_14MHZ</name>
                  <description>6.144 MHz</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_7_37MHZ</name>
                  <description>7.3728 MHz</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8MHZ</name>
                  <description>8 MHz</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8_19MHZ</name>
                  <description>8.192 MHz</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_10MHZ</name>
                  <description>10 MHz</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_12MHZ</name>
                  <description>12 MHz</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_12_2MHZ</name>
                  <description>12.288 MHz</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_13_5MHZ</name>
                  <description>13.56 MHz</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_14_3MHZ</name>
                  <description>14.31818 MHz</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16MHZ</name>
                  <description>16 MHz</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_3MHZ</name>
                  <description>16.384 MHz</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_18MHZ</name>
                  <description>18.0 MHz (USB)</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_20MHZ</name>
                  <description>20.0 MHz (USB)</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24MHZ</name>
                  <description>24.0 MHz (USB)</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_25MHZ</name>
                  <description>25.0 MHz (USB)</description>
                  <value>0x1a</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASS</name>
              <description>PLL Bypass</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWRDN</name>
              <description>PLL Power Down</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWMDIV</name>
              <description>PWM Unit Clock Divisor</description>
              <lsb>17</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_2</name>
                  <description>PWM clock /2</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4</name>
                  <description>PWM clock /4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8</name>
                  <description>PWM clock /8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16</name>
                  <description>PWM clock /16</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32</name>
                  <description>PWM clock /32</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64</name>
                  <description>PWM clock /64</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USEPWMDIV</name>
              <description>Enable PWM Clock Divisor</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USESYSDIV</name>
              <description>Enable System Clock Divider</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSDIV</name>
              <description>System Clock Divisor</description>
              <lsb>23</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ACG</name>
              <description>Auto Clock Gating</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOHBCTL</name>
          <displayName>SYSCTL_GPIOHBCTL</displayName>
          <description>GPIO High-Performance Bus Control</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PORTA</name>
              <description>Port A Advanced High-Performance Bus</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTB</name>
              <description>Port B Advanced High-Performance Bus</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTC</name>
              <description>Port C Advanced High-Performance Bus</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTD</name>
              <description>Port D Advanced High-Performance Bus</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTE</name>
              <description>Port E Advanced High-Performance Bus</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTF</name>
              <description>Port F Advanced High-Performance Bus</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
