m-labs/dslite2svd/svd/tm4c123x.xml
        <register>
          <name>DC9</name>
          <displayName>SYSCTL_DC9</displayName>
          <description>Device Capabilities 9</description>
          <addressOffset>0x00000190</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC0DC0</name>
              <description>ADC0 DC0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0DC1</name>
              <description>ADC0 DC1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0DC2</name>
              <description>ADC0 DC2 Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0DC3</name>
              <description>ADC0 DC3 Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0DC4</name>
              <description>ADC0 DC4 Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0DC5</name>
              <description>ADC0 DC5 Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0DC6</name>
              <description>ADC0 DC6 Present</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0DC7</name>
              <description>ADC0 DC7 Present</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1DC0</name>
              <description>ADC1 DC0 Present</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1DC1</name>
              <description>ADC1 DC1 Present</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1DC2</name>
              <description>ADC1 DC2 Present</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1DC3</name>
              <description>ADC1 DC3 Present</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1DC4</name>
              <description>ADC1 DC4 Present</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1DC5</name>
              <description>ADC1 DC5 Present</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1DC6</name>
              <description>ADC1 DC6 Present</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1DC7</name>
              <description>ADC1 DC7 Present</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMSTAT</name>
          <displayName>SYSCTL_NVMSTAT</displayName>
          <description>Non-Volatile Memory Information</description>
          <addressOffset>0x000001A0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FWB</name>
              <description>32 Word Flash Write Buffer Available</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDOSPCTL</name>
          <displayName>SYSCTL_LDOSPCTL</displayName>
          <description>LDO Sleep Power Control</description>
          <addressOffset>0x000001B4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VLDO</name>
              <description>LDO Output Voltage</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0_90V</name>
                  <description>0.90 V</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_0_95V</name>
                  <description>0.95 V</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_00V</name>
                  <description>1.00 V</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_05V</name>
                  <description>1.05 V</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_10V</name>
                  <description>1.10 V</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_15V</name>
                  <description>1.15 V</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_20V</name>
                  <description>1.20 V</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADJEN</name>
              <description>Voltage Adjust Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDODPCTL</name>
          <displayName>SYSCTL_LDODPCTL</displayName>
          <description>LDO Deep-Sleep Power Control</description>
          <addressOffset>0x000001BC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VLDO</name>
              <description>LDO Output Voltage</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0_90V</name>
                  <description>0.90 V</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_0_95V</name>
                  <description>0.95 V</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_00V</name>
                  <description>1.00 V</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_05V</name>
                  <description>1.05 V</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_10V</name>
                  <description>1.10 V</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_15V</name>
                  <description>1.15 V</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_20V</name>
                  <description>1.20 V</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADJEN</name>
              <description>Voltage Adjust Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPWD</name>
          <displayName>SYSCTL_PPWD</displayName>
          <description>Watchdog Timer Peripheral Present</description>
          <addressOffset>0x00000300</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>Watchdog Timer 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P1</name>
              <description>Watchdog Timer 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPTIMER</name>
          <displayName>SYSCTL_PPTIMER</displayName>
          <description>16/32-Bit General-Purpose Timer Peripheral Present</description>
          <addressOffset>0x00000304</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>16/32-Bit General-Purpose Timer 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P1</name>
              <description>16/32-Bit General-Purpose Timer 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P2</name>
              <description>16/32-Bit General-Purpose Timer 2 Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P3</name>
              <description>16/32-Bit General-Purpose Timer 3 Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P4</name>
              <description>16/32-Bit General-Purpose Timer 4 Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P5</name>
              <description>16/32-Bit General-Purpose Timer 5 Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPGPIO</name>
          <displayName>SYSCTL_PPGPIO</displayName>
          <description>General-Purpose Input/Output Peripheral Present</description>
          <addressOffset>0x00000308</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>GPIO Port A Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P1</name>
              <description>GPIO Port B Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P2</name>
              <description>GPIO Port C Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P3</name>
              <description>GPIO Port D Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P4</name>
              <description>GPIO Port E Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P5</name>
              <description>GPIO Port F Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P6</name>
              <description>GPIO Port G Present</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P7</name>
              <description>GPIO Port H Present</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P8</name>
              <description>GPIO Port J Present</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P9</name>
              <description>GPIO Port K Present</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P10</name>
              <description>GPIO Port L Present</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P11</name>
              <description>GPIO Port M Present</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P12</name>
              <description>GPIO Port N Present</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P13</name>
              <description>GPIO Port P Present</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P14</name>
              <description>GPIO Port Q Present</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPDMA</name>
          <displayName>SYSCTL_PPDMA</displayName>
          <description>Micro Direct Memory Access Peripheral Present</description>
          <addressOffset>0x0000030C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>uDMA Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPHIB</name>
          <displayName>SYSCTL_PPHIB</displayName>
          <description>Hibernation Peripheral Present</description>
          <addressOffset>0x00000314</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>Hibernation Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPUART</name>
          <displayName>SYSCTL_PPUART</displayName>
          <description>Universal Asynchronous Receiver/Transmitter Peripheral Present</description>
          <addressOffset>0x00000318</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>UART Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P1</name>
              <description>UART Module 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P2</name>
              <description>UART Module 2 Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P3</name>
              <description>UART Module 3 Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P4</name>
              <description>UART Module 4 Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P5</name>
              <description>UART Module 5 Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P6</name>
              <description>UART Module 6 Present</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P7</name>
              <description>UART Module 7 Present</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPSSI</name>
          <displayName>SYSCTL_PPSSI</displayName>
          <description>Synchronous Serial Interface Peripheral Present</description>
          <addressOffset>0x0000031C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>SSI Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P1</name>
              <description>SSI Module 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P2</name>
              <description>SSI Module 2 Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P3</name>
              <description>SSI Module 3 Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPI2C</name>
          <displayName>SYSCTL_PPI2C</displayName>
          <description>Inter-Integrated Circuit Peripheral Present</description>
          <addressOffset>0x00000320</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>I2C Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P1</name>
              <description>I2C Module 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P2</name>
              <description>I2C Module 2 Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P3</name>
              <description>I2C Module 3 Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P4</name>
              <description>I2C Module 4 Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P5</name>
              <description>I2C Module 5 Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPUSB</name>
          <displayName>SYSCTL_PPUSB</displayName>
          <description>Universal Serial Bus Peripheral Present</description>
          <addressOffset>0x00000328</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>USB Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPCAN</name>
          <displayName>SYSCTL_PPCAN</displayName>
          <description>Controller Area Network Peripheral Present</description>
          <addressOffset>0x00000334</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>CAN Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P1</name>
              <description>CAN Module 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPADC</name>
          <displayName>SYSCTL_PPADC</displayName>
          <description>Analog-to-Digital Converter Peripheral Present</description>
          <addressOffset>0x00000338</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>ADC Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>P1</name>
              <description>ADC Module 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
