m-labs/dslite2svd/svd/tm4c123x.xml
        <register>
          <name>RCGCTIMER</name>
          <displayName>SYSCTL_RCGCTIMER</displayName>
          <description>16/32-Bit General-Purpose Timer Run Mode Clock Gating Control</description>
          <addressOffset>0x00000604</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>16/32-Bit General-Purpose Timer 0 Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R1</name>
              <description>16/32-Bit General-Purpose Timer 1 Run Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R2</name>
              <description>16/32-Bit General-Purpose Timer 2 Run Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R3</name>
              <description>16/32-Bit General-Purpose Timer 3 Run Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R4</name>
              <description>16/32-Bit General-Purpose Timer 4 Run Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R5</name>
              <description>16/32-Bit General-Purpose Timer 5 Run Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCGPIO</name>
          <displayName>SYSCTL_RCGCGPIO</displayName>
          <description>General-Purpose Input/Output Run Mode Clock Gating Control</description>
          <addressOffset>0x00000608</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>GPIO Port A Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R1</name>
              <description>GPIO Port B Run Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R2</name>
              <description>GPIO Port C Run Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R3</name>
              <description>GPIO Port D Run Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R4</name>
              <description>GPIO Port E Run Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R5</name>
              <description>GPIO Port F Run Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCDMA</name>
          <displayName>SYSCTL_RCGCDMA</displayName>
          <description>Micro Direct Memory Access Run Mode Clock Gating Control</description>
          <addressOffset>0x0000060C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>uDMA Module Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCHIB</name>
          <displayName>SYSCTL_RCGCHIB</displayName>
          <description>Hibernation Run Mode Clock Gating Control</description>
          <addressOffset>0x00000614</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>Hibernation Module Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCUART</name>
          <displayName>SYSCTL_RCGCUART</displayName>
          <description>Universal Asynchronous Receiver/Transmitter Run Mode Clock Gating Control</description>
          <addressOffset>0x00000618</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>UART Module 0 Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R1</name>
              <description>UART Module 1 Run Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R2</name>
              <description>UART Module 2 Run Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R3</name>
              <description>UART Module 3 Run Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R4</name>
              <description>UART Module 4 Run Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R5</name>
              <description>UART Module 5 Run Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R6</name>
              <description>UART Module 6 Run Mode Clock Gating Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R7</name>
              <description>UART Module 7 Run Mode Clock Gating Control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCSSI</name>
          <displayName>SYSCTL_RCGCSSI</displayName>
          <description>Synchronous Serial Interface Run Mode Clock Gating Control</description>
          <addressOffset>0x0000061C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>SSI Module 0 Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R1</name>
              <description>SSI Module 1 Run Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R2</name>
              <description>SSI Module 2 Run Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R3</name>
              <description>SSI Module 3 Run Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCI2C</name>
          <displayName>SYSCTL_RCGCI2C</displayName>
          <description>Inter-Integrated Circuit Run Mode Clock Gating Control</description>
          <addressOffset>0x00000620</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>I2C Module 0 Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R1</name>
              <description>I2C Module 1 Run Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R2</name>
              <description>I2C Module 2 Run Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R3</name>
              <description>I2C Module 3 Run Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCUSB</name>
          <displayName>SYSCTL_RCGCUSB</displayName>
          <description>Universal Serial Bus Run Mode Clock Gating Control</description>
          <addressOffset>0x00000628</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>USB Module Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCCAN</name>
          <displayName>SYSCTL_RCGCCAN</displayName>
          <description>Controller Area Network Run Mode Clock Gating Control</description>
          <addressOffset>0x00000634</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>CAN Module 0 Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R1</name>
              <description>CAN Module 1 Run Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCADC</name>
          <displayName>SYSCTL_RCGCADC</displayName>
          <description>Analog-to-Digital Converter Run Mode Clock Gating Control</description>
          <addressOffset>0x00000638</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>ADC Module 0 Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R1</name>
              <description>ADC Module 1 Run Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCACMP</name>
          <displayName>SYSCTL_RCGCACMP</displayName>
          <description>Analog Comparator Run Mode Clock Gating Control</description>
          <addressOffset>0x0000063C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>Analog Comparator Module 0 Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCPWM</name>
          <displayName>SYSCTL_RCGCPWM</displayName>
          <description>Pulse Width Modulator Run Mode Clock Gating Control</description>
          <addressOffset>0x00000640</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>PWM Module 0 Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R1</name>
              <description>PWM Module 1 Run Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCQEI</name>
          <displayName>SYSCTL_RCGCQEI</displayName>
          <description>Quadrature Encoder Interface Run Mode Clock Gating Control</description>
          <addressOffset>0x00000644</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>QEI Module 0 Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R1</name>
              <description>QEI Module 1 Run Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCEEPROM</name>
          <displayName>SYSCTL_RCGCEEPROM</displayName>
          <description>EEPROM Run Mode Clock Gating Control</description>
          <addressOffset>0x00000658</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>EEPROM Module Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCWTIMER</name>
          <displayName>SYSCTL_RCGCWTIMER</displayName>
          <description>32/64-Bit Wide General-Purpose Timer Run Mode Clock Gating Control</description>
          <addressOffset>0x0000065C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>32/64-Bit Wide General-Purpose Timer 0 Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R1</name>
              <description>32/64-Bit Wide General-Purpose Timer 1 Run Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R2</name>
              <description>32/64-Bit Wide General-Purpose Timer 2 Run Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R3</name>
              <description>32/64-Bit Wide General-Purpose Timer 3 Run Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R4</name>
              <description>32/64-Bit Wide General-Purpose Timer 4 Run Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R5</name>
              <description>32/64-Bit Wide General-Purpose Timer 5 Run Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCWD</name>
          <displayName>SYSCTL_SCGCWD</displayName>
          <description>Watchdog Timer Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000700</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>Watchdog Timer 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S1</name>
              <description>Watchdog Timer 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCTIMER</name>
          <displayName>SYSCTL_SCGCTIMER</displayName>
          <description>16/32-Bit General-Purpose Timer Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000704</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>16/32-Bit General-Purpose Timer 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S1</name>
              <description>16/32-Bit General-Purpose Timer 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S2</name>
              <description>16/32-Bit General-Purpose Timer 2 Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S3</name>
              <description>16/32-Bit General-Purpose Timer 3 Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S4</name>
              <description>16/32-Bit General-Purpose Timer 4 Sleep Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S5</name>
              <description>16/32-Bit General-Purpose Timer 5 Sleep Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCGPIO</name>
          <displayName>SYSCTL_SCGCGPIO</displayName>
          <description>General-Purpose Input/Output Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000708</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>GPIO Port A Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S1</name>
              <description>GPIO Port B Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S2</name>
              <description>GPIO Port C Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S3</name>
              <description>GPIO Port D Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S4</name>
              <description>GPIO Port E Sleep Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S5</name>
              <description>GPIO Port F Sleep Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCDMA</name>
          <displayName>SYSCTL_SCGCDMA</displayName>
          <description>Micro Direct Memory Access Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000070C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>uDMA Module Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCHIB</name>
          <displayName>SYSCTL_SCGCHIB</displayName>
          <description>Hibernation Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000714</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>Hibernation Module Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
