m-labs/dslite2svd/svd/tm4c123x.xml
        <register>
          <name>SCGCUART</name>
          <displayName>SYSCTL_SCGCUART</displayName>
          <description>Universal Asynchronous Receiver/Transmitter Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000718</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>UART Module 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S1</name>
              <description>UART Module 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S2</name>
              <description>UART Module 2 Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S3</name>
              <description>UART Module 3 Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S4</name>
              <description>UART Module 4 Sleep Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S5</name>
              <description>UART Module 5 Sleep Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S6</name>
              <description>UART Module 6 Sleep Mode Clock Gating Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S7</name>
              <description>UART Module 7 Sleep Mode Clock Gating Control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCSSI</name>
          <displayName>SYSCTL_SCGCSSI</displayName>
          <description>Synchronous Serial Interface Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000071C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>SSI Module 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S1</name>
              <description>SSI Module 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S2</name>
              <description>SSI Module 2 Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S3</name>
              <description>SSI Module 3 Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCI2C</name>
          <displayName>SYSCTL_SCGCI2C</displayName>
          <description>Inter-Integrated Circuit Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000720</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>I2C Module 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S1</name>
              <description>I2C Module 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S2</name>
              <description>I2C Module 2 Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S3</name>
              <description>I2C Module 3 Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCUSB</name>
          <displayName>SYSCTL_SCGCUSB</displayName>
          <description>Universal Serial Bus Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000728</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>USB Module Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCCAN</name>
          <displayName>SYSCTL_SCGCCAN</displayName>
          <description>Controller Area Network Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000734</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>CAN Module 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S1</name>
              <description>CAN Module 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCADC</name>
          <displayName>SYSCTL_SCGCADC</displayName>
          <description>Analog-to-Digital Converter Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000738</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>ADC Module 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S1</name>
              <description>ADC Module 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCACMP</name>
          <displayName>SYSCTL_SCGCACMP</displayName>
          <description>Analog Comparator Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000073C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>Analog Comparator Module 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCPWM</name>
          <displayName>SYSCTL_SCGCPWM</displayName>
          <description>Pulse Width Modulator Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000740</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>PWM Module 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S1</name>
              <description>PWM Module 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCQEI</name>
          <displayName>SYSCTL_SCGCQEI</displayName>
          <description>Quadrature Encoder Interface Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000744</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>QEI Module 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S1</name>
              <description>QEI Module 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCEEPROM</name>
          <displayName>SYSCTL_SCGCEEPROM</displayName>
          <description>EEPROM Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000758</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>EEPROM Module Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCWTIMER</name>
          <displayName>SYSCTL_SCGCWTIMER</displayName>
          <description>32/64-Bit Wide General-Purpose Timer Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000075C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>32/64-Bit Wide General-Purpose Timer 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S1</name>
              <description>32/64-Bit Wide General-Purpose Timer 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S2</name>
              <description>32/64-Bit Wide General-Purpose Timer 2 Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S3</name>
              <description>32/64-Bit Wide General-Purpose Timer 3 Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S4</name>
              <description>32/64-Bit Wide General-Purpose Timer 4 Sleep Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S5</name>
              <description>32/64-Bit Wide General-Purpose Timer 5 Sleep Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCWD</name>
          <displayName>SYSCTL_DCGCWD</displayName>
          <description>Watchdog Timer Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000800</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>Watchdog Timer 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D1</name>
              <description>Watchdog Timer 1 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCTIMER</name>
          <displayName>SYSCTL_DCGCTIMER</displayName>
          <description>16/32-Bit General-Purpose Timer Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000804</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>16/32-Bit General-Purpose Timer 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D1</name>
              <description>16/32-Bit General-Purpose Timer 1 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D2</name>
              <description>16/32-Bit General-Purpose Timer 2 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D3</name>
              <description>16/32-Bit General-Purpose Timer 3 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D4</name>
              <description>16/32-Bit General-Purpose Timer 4 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D5</name>
              <description>16/32-Bit General-Purpose Timer 5 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCGPIO</name>
          <displayName>SYSCTL_DCGCGPIO</displayName>
          <description>General-Purpose Input/Output Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000808</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>GPIO Port A Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D1</name>
              <description>GPIO Port B Deep-Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D2</name>
              <description>GPIO Port C Deep-Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D3</name>
              <description>GPIO Port D Deep-Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D4</name>
              <description>GPIO Port E Deep-Sleep Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D5</name>
              <description>GPIO Port F Deep-Sleep Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCDMA</name>
          <displayName>SYSCTL_DCGCDMA</displayName>
          <description>Micro Direct Memory Access Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000080C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>uDMA Module Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCHIB</name>
          <displayName>SYSCTL_DCGCHIB</displayName>
          <description>Hibernation Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000814</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>Hibernation Module Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCUART</name>
          <displayName>SYSCTL_DCGCUART</displayName>
          <description>Universal Asynchronous Receiver/Transmitter Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000818</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>UART Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D1</name>
              <description>UART Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D2</name>
              <description>UART Module 2 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D3</name>
              <description>UART Module 3 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D4</name>
              <description>UART Module 4 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D5</name>
              <description>UART Module 5 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D6</name>
              <description>UART Module 6 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D7</name>
              <description>UART Module 7 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCSSI</name>
          <displayName>SYSCTL_DCGCSSI</displayName>
          <description>Synchronous Serial Interface Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000081C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>SSI Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D1</name>
              <description>SSI Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D2</name>
              <description>SSI Module 2 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D3</name>
              <description>SSI Module 3 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCI2C</name>
          <displayName>SYSCTL_DCGCI2C</displayName>
          <description>Inter-Integrated Circuit Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000820</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>I2C Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D1</name>
              <description>I2C Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D2</name>
              <description>I2C Module 2 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D3</name>
              <description>I2C Module 3 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCUSB</name>
          <displayName>SYSCTL_DCGCUSB</displayName>
          <description>Universal Serial Bus Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000828</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>USB Module Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
