m-labs/dslite2svd/svd/tm4c123x.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/udma.xml -->
    <peripheral>
      <name>UDMA</name>
      <description>Micro Direct Memory Access register addresses</description>
      <baseAddress>0x400FF000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>STAT</name>
          <displayName>UDMA_STAT</displayName>
          <description>DMA Status</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MASTEN</name>
              <description>Master Enable Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STATE</name>
              <description>Control State Machine Status</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_CTRL</name>
                  <description>Reading channel controller data</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_SRCENDP</name>
                  <description>Reading source end pointer</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_DSTENDP</name>
                  <description>Reading destination end pointer</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_SRCDAT</name>
                  <description>Reading source data</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_DSTDAT</name>
                  <description>Writing destination data</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT</name>
                  <description>Waiting for uDMA request to clear</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_CTRL</name>
                  <description>Writing channel controller data</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STALL</name>
                  <description>Stalled</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DONE</name>
                  <description>Done</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNDEF</name>
                  <description>Undefined</description>
                  <value>0xa</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMACHANS</name>
              <description>Available uDMA Channels Minus 1</description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <displayName>UDMA_CFG</displayName>
          <description>DMA Configuration</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MASTEN</name>
              <description>Controller Master Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTLBASE</name>
          <displayName>UDMA_CTLBASE</displayName>
          <description>DMA Channel Control Base Pointer</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Channel Control Base Address</description>
              <lsb>10</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALTBASE</name>
          <displayName>UDMA_ALTBASE</displayName>
          <description>DMA Alternate Channel Control Base Pointer</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Alternate Channel Address Pointer</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAITSTAT</name>
          <displayName>UDMA_WAITSTAT</displayName>
          <description>DMA Channel Wait-on-Request Status</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WAITREQ</name>
              <description>Channel [n] Wait Status</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREQ</name>
          <displayName>UDMA_SWREQ</displayName>
          <description>DMA Channel Software Request</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>write-only</access>
        </register>
        <register>
          <name>USEBURSTSET</name>
          <displayName>UDMA_USEBURSTSET</displayName>
          <description>DMA Channel Useburst Set</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SET</name>
              <description>Channel [n] Useburst Set</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USEBURSTCLR</name>
          <displayName>UDMA_USEBURSTCLR</displayName>
          <description>DMA Channel Useburst Clear</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLR</name>
              <description>Channel [n] Useburst Clear</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REQMASKSET</name>
          <displayName>UDMA_REQMASKSET</displayName>
          <description>DMA Channel Request Mask Set</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SET</name>
              <description>Channel [n] Request Mask Set</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REQMASKCLR</name>
          <displayName>UDMA_REQMASKCLR</displayName>
          <description>DMA Channel Request Mask Clear</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLR</name>
              <description>Channel [n] Request Mask Clear</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENASET</name>
          <displayName>UDMA_ENASET</displayName>
          <description>DMA Channel Enable Set</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SET</name>
              <description>Channel [n] Enable Set</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENACLR</name>
          <displayName>UDMA_ENACLR</displayName>
          <description>DMA Channel Enable Clear</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLR</name>
              <description>Clear Channel [n] Enable Clear</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALTSET</name>
          <displayName>UDMA_ALTSET</displayName>
          <description>DMA Channel Primary Alternate Set</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SET</name>
              <description>Channel [n] Alternate Set</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALTCLR</name>
          <displayName>UDMA_ALTCLR</displayName>
          <description>DMA Channel Primary Alternate Clear</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLR</name>
              <description>Channel [n] Alternate Clear</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIOSET</name>
          <displayName>UDMA_PRIOSET</displayName>
          <description>DMA Channel Priority Set</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SET</name>
              <description>Channel [n] Priority Set</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIOCLR</name>
          <displayName>UDMA_PRIOCLR</displayName>
          <description>DMA Channel Priority Clear</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLR</name>
              <description>Channel [n] Priority Clear</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERRCLR</name>
          <displayName>UDMA_ERRCLR</displayName>
          <description>DMA Bus Error Clear</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ERRCLR</name>
              <description>uDMA Bus Error Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHASGN</name>
          <displayName>UDMA_CHASGN</displayName>
          <description>DMA Channel Assignment</description>
          <addressOffset>0x00000500</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CHASGN</name>
              <description>Channel [n] Assignment Select</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRIMARY</name>
                  <description>Use the primary channel assignment</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECONDARY</name>
                  <description>Use the secondary channel assignment</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIS</name>
          <displayName>UDMA_CHIS</displayName>
          <description>DMA Channel Interrupt Status</description>
          <addressOffset>0x00000504</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CHMAP0</name>
          <displayName>UDMA_CHMAP0</displayName>
          <description>DMA Channel Map Select 0</description>
          <addressOffset>0x00000510</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH0SEL</name>
              <description>uDMA Channel 0 Source Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1SEL</name>
              <description>uDMA Channel 1 Source Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2SEL</name>
              <description>uDMA Channel 2 Source Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3SEL</name>
              <description>uDMA Channel 3 Source Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4SEL</name>
              <description>uDMA Channel 4 Source Select</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5SEL</name>
              <description>uDMA Channel 5 Source Select</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6SEL</name>
              <description>uDMA Channel 6 Source Select</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7SEL</name>
              <description>uDMA Channel 7 Source Select</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHMAP1</name>
          <displayName>UDMA_CHMAP1</displayName>
          <description>DMA Channel Map Select 1</description>
          <addressOffset>0x00000514</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH8SEL</name>
              <description>uDMA Channel 8 Source Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH9SEL</name>
              <description>uDMA Channel 9 Source Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH10SEL</name>
              <description>uDMA Channel 10 Source Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH11SEL</name>
              <description>uDMA Channel 11 Source Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH12SEL</name>
              <description>uDMA Channel 12 Source Select</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH13SEL</name>
              <description>uDMA Channel 13 Source Select</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH14SEL</name>
              <description>uDMA Channel 14 Source Select</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH15SEL</name>
              <description>uDMA Channel 15 Source Select</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHMAP2</name>
          <displayName>UDMA_CHMAP2</displayName>
          <description>DMA Channel Map Select 2</description>
          <addressOffset>0x00000518</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH16SEL</name>
              <description>uDMA Channel 16 Source Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH17SEL</name>
              <description>uDMA Channel 17 Source Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH18SEL</name>
              <description>uDMA Channel 18 Source Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH19SEL</name>
              <description>uDMA Channel 19 Source Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH20SEL</name>
              <description>uDMA Channel 20 Source Select</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH21SEL</name>
              <description>uDMA Channel 21 Source Select</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH22SEL</name>
              <description>uDMA Channel 22 Source Select</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH23SEL</name>
              <description>uDMA Channel 23 Source Select</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHMAP3</name>
          <displayName>UDMA_CHMAP3</displayName>
          <description>DMA Channel Map Select 3</description>
          <addressOffset>0x0000051C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH24SEL</name>
              <description>uDMA Channel 24 Source Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH25SEL</name>
              <description>uDMA Channel 25 Source Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH26SEL</name>
              <description>uDMA Channel 26 Source Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH27SEL</name>
              <description>uDMA Channel 27 Source Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH28SEL</name>
              <description>uDMA Channel 28 Source Select</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH29SEL</name>
              <description>uDMA Channel 29 Source Select</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH30SEL</name>
              <description>uDMA Channel 30 Source Select</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CH31SEL</name>
              <description>uDMA Channel 31 Source Select</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
